import styles from "./Description.module.css";
export default function Description({product}) {
  return (
    <div>
      <h1 className={styles.desc_title}>پیتزا مخلوط</h1>
      <p className={styles.desc_text}>
      {product.description}
      </p>
      {/* <p className={styles.desc_text}>
        در ایتالیا، پیتزایی که در مکان‌های رسمی مانند رستوران‌ها سرو می‌شود، برش
        نخورده‌است و با کارد و چنگال خورده می‌شود.[۴][۵] با این‌حال در مکان‌های
        غیررسمی‌تر، پیتزا برش خورده تحویل داده می‌شود و با دست خورده می‌شود.
      </p>
      <p className={styles.desc_text}>
        اصطلاح پیتزا برای اولین بار در قرن دهم میلادی به‌زبان لاتین در
        دست‌نوشته‌ای در شهر گائتا (واقع در جنوب ایتالیا) به ثبت رسیده‌است.[۶][۷]
        پیتزای امروزی در ناپل اختراع شد و دستورالعمل تهیه آن در کشورهای مختلفی
        با تغییرات متعددی استفاده شده‌است.[۸] پیتزا یکی از مشهورترین غذاهای دنیا
        به‌حساب می‌آید و به‌عنوان یک فست‌فود متداول در اروپا و آمریکا استفاده
        می‌شود.[۹] بسیاری از شرکت‌ها پیتزاهای منجمد از قبل پخت شده را به‌فروش
        می‌رسانند که کافی است کمی گرم شود تا آماده مصرف شود.
      </p> */}
    </div>
  );
}
