import styles from "./Description.module.css";
export default function Description() {
  return (
    <div>
      <h1 className={styles.desc_title}>پیتزا مخلوط</h1>
      <p className={styles.desc_text}>
        پیتزا (به ایتالیایی: Pizza)[۱] غذایی است به شکل نان گِرد صافی که در فر
        یا اجاق‌گاز یا تنور پخته می‌شود و معمولاً روی آن را با سس گوجه‌فرنگی و
        پنیر می‌پوشانند و همچنین مواد دلخواه دیگر، روی نان اضافه می‌کنند. پنیری
        که استفاده می‌شود معمولاً پنیر موزارلا یا پنیر پیتزا است. همچنین از مواد
        مختلفی (مانند ژامبون، قارچ، زیتون، پیاز، فلفل سبز، گوجه فرنگی و …) برای
        تهیه پیتزا استفاده می‌شود. به یک پیتزای کوچک پیزتا (Pizzetta)[۲] و به
        کسی که پیتزا می‌پزد، پیزائولو (Pizzaiolo) گفته می‌شود.[۳]
      </p>
      <p className={styles.desc_text}>
        در ایتالیا، پیتزایی که در مکان‌های رسمی مانند رستوران‌ها سرو می‌شود، برش
        نخورده‌است و با کارد و چنگال خورده می‌شود.[۴][۵] با این‌حال در مکان‌های
        غیررسمی‌تر، پیتزا برش خورده تحویل داده می‌شود و با دست خورده می‌شود.
      </p>
      <p className={styles.desc_text}>
        اصطلاح پیتزا برای اولین بار در قرن دهم میلادی به‌زبان لاتین در
        دست‌نوشته‌ای در شهر گائتا (واقع در جنوب ایتالیا) به ثبت رسیده‌است.[۶][۷]
        پیتزای امروزی در ناپل اختراع شد و دستورالعمل تهیه آن در کشورهای مختلفی
        با تغییرات متعددی استفاده شده‌است.[۸] پیتزا یکی از مشهورترین غذاهای دنیا
        به‌حساب می‌آید و به‌عنوان یک فست‌فود متداول در اروپا و آمریکا استفاده
        می‌شود.[۹] بسیاری از شرکت‌ها پیتزاهای منجمد از قبل پخت شده را به‌فروش
        می‌رسانند که کافی است کمی گرم شود تا آماده مصرف شود.
      </p>
    </div>
  );
}
